/*
Да се дефинират на пролог едноместни предикати q1, q2 , q3 и q4 .
такива че даден списък X:
(1) q1 разпознава дали празният списък е елемент на X,
(2) q2 разпознава дали X съдържа елементи Y и Z, които нямат общи
елементи,
(3) q3 разпознава дали X съдържа елемент Y, чиито елементи са
еленти на всички елемeнти на X,
(4) q4 разпознава дали за всеки елемент Y на X съществува такъв
елемент Z на X, че Y и Z нямат общи елемeнти.


Казваме, че списък X мажорира списък Y , ако
всички елементи на X са елементи на Y . Да се дефинира
на пролог предикат p(L, M ), който по даден списък от спи-
съци L намира списък M , който съдържа всички елементи
на L и в който никой елемент не се мажорира от елемент,
намиращ се след него в списъка.


Нека за всяко положително число i с ξ(i) и с η(i) означим съответно броя
на простите числа от вида 6k + 1 и 6k + 5, които са по-малки от i.
Да се дефинират на пролог еднометсни предикати su(X) и mu(X), които
по дадено цяло число X разпознават дали за някое положително цяло
число i е в сила равенството X = i+ξ(i) за su(X) и X = i−η(i) за mu(X).


Да се дефинира на Пролог двуместен предикат,
който по дадени две цели числа разпознава дали те имат
едни и същи прости делители.


 Ще казваме, че един списък е анаграма на друг, ако е съставен от същите елементи, но
в евентуално различен ред.
Да се дефинира предикат на пролог maxAnagrams(L, M ) на пролог, който по даден
списък от списъци L, генерира в M най-голямото число, за което има поне M на брой:
• M -елементни списъка от L, които са анаграми един на друг.
• (M + 2)-елементни списъка от L, които са анаграми един на друг.


Представяне на точка (p, q) ∈ Q × Q с рационални координати в равнината
наричаме всяка четворка (ap , bp , aq , bq ) ∈ Z4 , за която a bp p = p и bq aq = q. (в частност
bp 6= 0 6= bq .)
Да се дефинира на пролог предикат:
1. max_independent(S, M ), който по даден краен списък S от представяния
на точки с рационални координати в равнината генерира в M максимално
по размер подмножество на S, така че никои две различни окръжностицентрове в точки, представени от елементи на M , и радиуси 1 нямат общи


I.2 Дървото на Раней, R, е пълно двоично дърво, във върховете на което
така са поставени двойките естествени числа, че:
• в корена на R е поставена двойката (1, 1);
• ако в един връх v на R е поставена двойката (a, b), то в левия наслед-
ник на v е поставена двойката (a, a + b), а в десния - (a + b, b).
Да се дефинира на пролог едноместен предикат raney(L), който при пре-
удовлетворяване генерира в L всички етажи от дървото на Раней.

*/

